GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
	return ( ( ( (unsigned long)( year / 4 - year / 100 + year / 400 + 367 * mon / 12 + day ) +
	             year * 365 - 719499
	             ) * 24 + hour      /**//* now have hours */
	           ) * 60 + min         /**//* now have minutes */
	         ) * 60 + sec;          /**//* finally seconds */
}

/*计算距离*/
uint32_t calc_distance( void )
{
	static uint32_t utc_distance_last = 0;
#if 0
	if( gps_lati_last )                             /*首次定位*/
	{
		distance				= dis_Point2Point( gps_lati_last, gps_longi_last, gps_lati, gps_longi );
		total_distance			+= distance;
		jt808_param.id_0xF020	= total_distance;   /*总里程m*/
	}
	gps_lati_last	= gps_lati;
	gps_longi_last	= gps_longi;
	/**/
	return distance;
#endif
/*速度积分*/
	if( ( ( utc_now - utc_distance_last ) == 1 ) || ( utc_distance_last == 0 ) )
	{
		distance				+= gps_speed / 3.6; /*单位kmh->m/s*/
		total_distance			+= gps_speed / 3.6;
		jt808_param.id_0xF020	= total_distance;   /*总里程m*/
	}
}

#if 0
/**/
static double gpsToRad( GPSPoint point )
{
	return point.sign * ( point.deg + ( point.min + point.sec / 60.0 ) / 60.0 ) * 3.141592654 / 180.0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static double getDistance( GPSPoint latFrom, GPSPoint lngFrom, GPSPoint latTo, GPSPoint lngTo )
{
	double	latFromRad	= gpsToRad( latFrom );
	double	lngFromRad	= gpsToRad( lngFrom );
	double	latToRad	= gpsToRad( latTo );
	double	lngToRad	= gpsToRad( lngTo );
	double	lngDiff		= lngToRad - lngFromRad;
	double	part1		= pow( cos( latToRad ) * sin( lngDiff ), 2 );
	//double part2 = pow( cos(latFromRad)*sin(latToRad)*cos(lngDiff) , 2);
	double	part2 = pow( cos( latFromRad ) * sin( latToRad ) - sin( latFromRad ) * cos( latToRad ) * cos( lngDiff ), 2 );

	double	part3 = sin( latFromRad ) * sin( latToRad ) + cos( latFromRad ) * cos( latToRad ) * cos( lngDiff );
	//double centralAngle = atan2( sqrt(part1 + part2) / part3 );
	double	centralAngle = atan( sqrt( part1 + part2 ) / part3 );
	return 6371.01 * 1000.0 * centralAngle; //Return Distance in meter
}

#endif

#define DF_POSTREPORT_START		0x00298000
#define DF_POSTREPORT_END		0x002FC000
#define DF_POSTREPORT_SECTORS	100

typedef __packed struct
{
	uint32_t	mn;
	uint32_t	id;
	uint8_t		attr;
	uint8_t		unused;
	uint16_t	len;
}GPS_REPORT_HEAD;

static uint32_t postreport_curr_addr	= 0;    /*当前记录的地址*/
static uint32_t postreport_curr_id		= 0;    /*当前记录的最大id*/
static uint32_t postreport_curr_len		= 0;    /*当前记录的用户信息长度*/

static uint32_t postreport_addr_rd	= 0;        /*要读记录的位置,第一个未上报的数据位置*/
static uint32_t postreport_count	= 0;        /*还没有上报的记录数*/


/*
   查找第一个未上报数据的位置，最新写入位置
 */
void jt808_postreport_init( void )
{
	uint32_t		addr;
	GPS_REPORT_HEAD head;
	uint32_t		id = 0;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );
	for( addr = DF_POSTREPORT_START; addr < DF_POSTREPORT_END; addr += 64 )
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )             /*有效记录*/
		{
			if( head.id >= postreport_curr_id ) /*查找最近记录*/
			{
				postreport_curr_id		= head.id;
				postreport_curr_addr	= addr; /*当前记录的地址*/
				postreport_curr_len		= head.len;
			}
			if( head.attr == 0xFF )             /*还没有发送*/
			{
				postreport_count++;             /*统计未上报记录数*/
				if( postreport_addr_rd == 0 )   /*还没有找到要发送的地址*/
				{
					postreport_addr_rd = addr;  /*记录第一个要发送数据的地址*/
				}
			}
		}
	}
	rt_sem_release( &sem_dataflash );
}

/*补报数据保存*/
void jt808_postreport_put( uint8_t* pinfo, uint16_t len )
{
	GPS_REPORT_HEAD head;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	if( postreport_curr_addr )
	{
		postreport_curr_addr	+= ( 12 + postreport_curr_len + 63 );
		postreport_curr_addr	&= 0xFFFFFFC0;  /*指向下一个地址*/
	}else                                       /*还没有记录*/
	{
		postreport_curr_addr = DF_POSTREPORT_START;
	}

	if( postreport_curr_addr >= DF_POSTREPORT_END )
	{
		postreport_curr_addr = DF_POSTREPORT_START;
	}
	if( ( postreport_curr_addr & 0xFFF ) == 0 )
	{
		sst25_erase_4k( postreport_curr_addr );
	}

	postreport_curr_id++;

	head.mn		= 0x474E5353;
	head.id		= postreport_curr_id;
	head.len	= len;
	head.attr	= 0xFF;

	sst25_write_through( postreport_curr_addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
	sst25_write_through( postreport_curr_addr + 12, pinfo, len );
	postreport_count++;                          /*增加未上报记录数*/
	postreport_curr_len = len;

	rt_sem_release( &sem_dataflash );
}

/*
补报数据更新原先的并读取新纪录
每次收到中心应答后调用
*/
void jt808_postreport_get( void )
{
	if( postreport_count )                                      /*没有有未上报记录*/
	{
		return;
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );
	/*原先没有记录,现在有新的记录了，应该是最近写入的,也可能多条*/
	if( postreport_addr_rd == 0 )                               
	{
		
	}else /*修改原先记录为已上报*/
	{
	}
/*读取当前的记录*/

	rt_sem_release( &sem_dataflash );
}

/*
   处理gps信息,有多种条件组合，上报
   此时已收到争取的
 */

#define FLAG_SEND_AREA			0x80
#define FLAG_SEND_STATUS		0x01
#define FLAG_SEND_ALARM			0x02
#define FLAG_SEND_FIX_TIME		0x04
#define FLAG_SEND_FIX_DISTANCE	0x08


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void process_gps_report( void )
{
	static uint32_t utc_report_last = 0;
	uint32_t		tmp;
	uint8_t			flag_send	= 0; /*默认不上报*/
	uint8_t			*palarmdata = RT_NULL;
	uint16_t		alarm_length;
	uint32_t		alarm_bits;

	uint8_t			buf[300];

/*区域路线处理*/
	alarm_bits = area_get_alarm( palarmdata, &alarm_length );
	if( alarm_bits ) /*有告警*/
	{
		rt_kprintf( "\n区域有告警" );
		memcpy( buf + 28, palarmdata, alarm_length );
		flag_send = FLAG_SEND_AREA;
	}
	jt808_alarm			|= alarm_bits;
	gps_baseinfo.alarm	= BYTESWAP4( jt808_alarm );
	gps_baseinfo.status = BYTESWAP4( jt808_status );
	memcpy( buf, (uint8_t*)&gps_baseinfo, 28 );

/*中心追踪,直接上报，并返回*/
	if( jt808_8202_track_duration ) /*要追踪*/
	{
		jt808_8202_track_counter++;
		if( jt808_8202_track_counter >= jt808_8202_track_interval )
		{
			jt808_8202_track_counter = 0;
			jt808_tx( 0x0200, buf, 28 + alarm_length );
			if( jt808_8202_track_duration > jt808_8202_track_interval )
			{
				jt808_8202_track_duration -= jt808_8202_track_interval;
			}else
			{
				jt808_8202_track_duration = 0;
			}
		}
		return;
	}

